In [1]:
import numpy as np
import pandas as pd

In [2]:
filas = ['ventas1', 'ventas2', 'ventas3']
columnas = ['zonaA', 'zonaB', 'zonaC']
datos = [[123,434,567], [566,534,572], [532,107,493]]

In [3]:
dataframe = pd.DataFrame(datos, filas, columnas)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572
ventas3    532    107    493

In [4]:
dataframe.loc[['ventas1','ventas2']]

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572

In [5]:
dataframe['zonaA']

ventas1    123
ventas2    566
ventas3    532
Name: zonaA, dtype: int64

In [6]:
dataframe.loc['ventas1'] ['zonaB']

434

In [7]:
dataframe['VentasTotales'] = dataframe['zonaA'] + dataframe['zonaB'] + dataframe['zonaC']
dataframe

         zonaA  zonaB  zonaC  VentasTotales
ventas1    123    434    567           1124
ventas2    566    534    572           1672
ventas3    532    107    493           1132

In [8]:
dataframe.drop('VentasTotales', axis = 1)

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572
ventas3    532    107    493

In [9]:
dataframe

         zonaA  zonaB  zonaC  VentasTotales
ventas1    123    434    567           1124
ventas2    566    534    572           1672
ventas3    532    107    493           1132

In [10]:
dataframe.drop('VentasTotales', axis = 1, inplace = True)

In [11]:
dataframe

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas2    566    534    572
ventas3    532    107    493

In [12]:
dataframe.drop("ventas2")

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas3    532    107    493

In [13]:
dataframe.shape

(3, 3)

In [14]:
dataframe.drop("ventas2", inplace=True)
dataframe

         zonaA  zonaB  zonaC
ventas1    123    434    567
ventas3    532    107    493

In [15]:
dataframe.shape

(2, 3)

# DataFrames: Selección de datos con una condición

In [16]:
fila = 'ventas1 ventas2 ventas3'.split()
fila

['ventas1', 'ventas2', 'ventas3']

In [17]:
columna = 'zonaA zonaB zonaC'.split()
columna

['zonaA', 'zonaB', 'zonaC']

In [18]:
dato = [[165, 589, 645], [789,654,798], [398,878,145]]
dato

[[165, 589, 645], [789, 654, 798], [398, 878, 145]]

In [19]:
DF = pd.DataFrame(dato, fila, columna)
DF

         zonaA  zonaB  zonaC
ventas1    165    589    645
ventas2    789    654    798
ventas3    398    878    145

In [20]:
condicion = DF > 200

In [21]:
DF[condicion]

         zonaA  zonaB  zonaC
ventas1    NaN    589  645.0
ventas2  789.0    654  798.0
ventas3  398.0    878    NaN

In [22]:
condicion1 = DF['zonaA'] > 200
DF[condicion1]

         zonaA  zonaB  zonaC
ventas2    789    654    798
ventas3    398    878    145

In [23]:
condicion2 = (DF['zonaA'] > 200) & (DF['zonaB'] > 50)
DF[condicion2]

         zonaA  zonaB  zonaC
ventas2    789    654    798
ventas3    398    878    145

In [24]:
condicion3 = (DF['zonaA'] > 200) | (DF['zonaB'] > 50)
DF[condicion3]

         zonaA  zonaB  zonaC
ventas1    165    589    645
ventas2    789    654    798
ventas3    398    878    145

## DataFrames: Modificación de los nombres de las filas

In [25]:
Ventas = 'venta1 venta2 venta2'.split()
Zonas = 'zonaA zonaB zonaC'.split()
Valores = [[100,200,450], [158,159,658], [314,589,146]]
DFV = pd.DataFrame(Valores, Ventas, Zonas)
DFV

        zonaA  zonaB  zonaC
venta1    100    200    450
venta2    158    159    658
venta2    314    589    146

In [26]:
NuevasVentas = 'dia1 dia2 dia3'.split()
NuevasVentas

['dia1', 'dia2', 'dia3']

In [27]:
DFV['dias'] = NuevasVentas
DFV

        zonaA  zonaB  zonaC  dias
venta1    100    200    450  dia1
venta2    158    159    658  dia2
venta2    314    589    146  dia3

In [28]:
DFV = DFV.set_index('dias')
DFV

      zonaA  zonaB  zonaC
dias
dia1    100    200    450
dia2    158    159    658
dia3    314    589    146

## Pandas: Tratamiento de valores nulos o sin valor

In [29]:
diccionario = {'A':[4,5,np.nan], 'B':[6,4,2], 'C':[np.nan, 4, np.nan]}

In [30]:
DFN = pd.DataFrame(diccionario)
DFN

     A  B    C
0  4.0  6  NaN
1  5.0  4  4.0
2  NaN  2  NaN

In [31]:
DFN.dropna()

     A  B    C
1  5.0  4  4.0

In [32]:
DFN.dropna(axis=1)

   B
0  6
1  4
2  2

In [33]:
DFN

     A  B    C
0  4.0  6  NaN
1  5.0  4  4.0
2  NaN  2  NaN

In [34]:
DFN.fillna(value=150)

       A  B      C
0    4.0  6  150.0
1    5.0  4    4.0
2  150.0  2  150.0

In [35]:
valor_medio = DFN.mean()
valor_medio

A    4.5
B    4.0
C    4.0
dtype: float64

In [36]:
DFN.fillna(value=valor_medio)

     A  B    C
0  4.0  6  4.0
1  5.0  4  4.0
2  4.5  2  4.0

## Agrupación de datos

In [41]:
diccionario1 = {'dias' : ['dia1','dia1', 'dia2', 'dia2', 'dia3'], 'vendedores' : ['Antonio', 'Juan', 'Mario', 'Ana', 'Luna'], 
                'Ventas' : [100,200,360,698,580]}

DFE = pd.DataFrame(diccionario1)
DFE

   dias vendedores  Ventas
0  dia1    Antonio     100
1  dia1       Juan     200
2  dia2      Mario     360
3  dia2        Ana     698
4  dia3       Luna     580

In [42]:
DFE.groupby('dias').mean()

<ipython-input-42-2d6a2404038c>:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  DFE.groupby('dias').mean()

      Ventas
dias
dia1   150.0
dia2   529.0
dia3   580.0

In [43]:
DFE.groupby('dias').sum()

<ipython-input-43-70c9c4b34870>:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  DFE.groupby('dias').sum()

      Ventas
dias
dia1     300
dia2    1058
dia3     580

In [44]:
DFE.groupby('dias').describe()

     Ventas
      count   mean         std    min    25%    50%    75%    max
dias
dia1    2.0  150.0   70.710678  100.0  125.0  150.0  175.0  200.0
dia2    2.0  529.0  239.002092  360.0  444.5  529.0  613.5  698.0
dia3    1.0  580.0         NaN  580.0  580.0  580.0  580.0  580.0